export default {
  projections: {
    ОтчетОЗакупкахE: {
      номер: {
        __caption__: ''
      },
      датаНачала: {
        __caption__: ''
      },
      датаОкончания: {
        __caption__: ''
      },
      организация: {
        __caption__: ''
      },
      склад: {
        __caption__: ''
      },
      контрагент: {
        __caption__: ''
      },
      состОтгрузки: {
        __caption__: ''
      },
      состояниеОплаты: {
        __caption__: ''
      },
      суммаВклНДС: {
        __caption__: ''
      },
      суммаДокумента: {
        __caption__: ''
      }
    },
    ОтчетОЗакупкахL: {
      номер: {
        __caption__: ''
      },
      датаНачала: {
        __caption__: ''
      },
      датаОкончания: {
        __caption__: ''
      },
      организация: {
        __caption__: ''
      },
      склад: {
        __caption__: ''
      },
      контрагент: {
        __caption__: ''
      },
      состОтгрузки: {
        __caption__: ''
      },
      состояниеОплаты: {
        __caption__: ''
      },
      суммаВклНДС: {
        __caption__: ''
      },
      суммаДокумента: {
        __caption__: ''
      }
    }
  },
  validations: {
    датаНачала: {
      __caption__: 'датаНачала'
    },
    датаОкончания: {
      __caption__: 'датаОкончания'
    },
    контрагент: {
      __caption__: 'контрагент'
    },
    номер: {
      __caption__: 'номер'
    },
    организация: {
      __caption__: 'организация'
    },
    склад: {
      __caption__: 'склад'
    },
    состОтгрузки: {
      __caption__: 'состОтгрузки'
    },
    состояниеОплаты: {
      __caption__: 'состояниеОплаты'
    },
    суммаВклНДС: {
      __caption__: 'суммаВклНДС'
    },
    суммаДокумента: {
      __caption__: 'суммаДокумента'
    }
  }
};
